api/app/controllers/authentication_controller.rb

  def login
    @author = Author.find_by_name(params[:name])
---
SELECT "authors".* FROM "authors" WHERE "authors"."name" = ? LIMIT ?  [["name", "teste"], ["LIMIT", 1]]