api/app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "password", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "Luis"], ["password", "[FILTERED]"], ["created_at", "2022-04-25 14:45:55.194799"], ["updated_at", "2022-04-25 14:45:55.194799"], ["password_digest", "[FILTERED]"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save